In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('sample1_with_index.csv')

In [3]:
df.head(2)

,Unnamed: 0,Date,Price,Quantity,Width,Height,Quality,Score,Difference,Color,Shape
0,0,1997-07-05,2291,25,2.946650,5.305868,45.893300,52.762659,0.276266,green,triangle
1,1,1997-07-06,506,16,1.915208,0.679004,50.611735,31.453719,-1.854628,blue,NaN

In [4]:
df = pd.read_csv('sample1_with_index.csv', index_col=0)
df.head(2)

,Date,Price,Quantity,Width,Height,Quality,Score,Difference,Color,Shape
0,1997-07-05,2291,25,2.946650,5.305868,45.893300,52.762659,0.276266,green,triangle
1,1997-07-06,506,16,1.915208,0.679004,50.611735,31.453719,-1.854628,blue,NaN

In [6]:
df = pd.read_csv('sample1_without_index.csv')
df.head(2)

,Date,Price,Quantity,Width,Height,Quality,Score,Difference,Color,Shape
0,1997-07-05,2291,25,2.946650,5.305868,45.893300,52.762659,0.276266,green,triangle
1,1997-07-06,506,16,1.915208,0.679004,50.611735,31.453719,-1.854628,blue,NaN

In [9]:
df_p = pd.read_pickle('sample1.pkl')
df_p.head(2)

,Date,Price,Quantity,Width,Height,Quality,Score,Difference,Color,Shape
0,1997-07-05,2291,25,2.946650,5.305868,45.893300,52.762659,0.276266,green,triangle
1,1997-07-06,506,16,1.915208,0.679004,50.611735,31.453719,-1.854628,blue,NaN

In [10]:
df_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        97 non-null     datetime64[ns]
 1   Price       100 non-null    int64
 2   Quantity    100 non-null    int64
 3   Width       97 non-null     float64
 4   Height      97 non-null     float64
 5   Quality     96 non-null     float64
 6   Score       93 non-null     float64
 7   Difference  99 non-null     float64
 8   Color       96 non-null     object
 9   Shape       95 non-null     object
dtypes: datetime64[ns](1), float64(5), int64(2), object(2)
memory usage: 7.9+ KB

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        97 non-null     object
 1   Price       100 non-null    int64
 2   Quantity    100 non-null    int64
 3   Width       97 non-null     float64
 4   Height      97 non-null     float64
 5   Quality     96 non-null     float64
 6   Score       93 non-null     float64
 7   Difference  99 non-null     float64
 8   Color       96 non-null     object
 9   Shape       95 non-null     object
dtypes: float64(5), int64(2), object(3)
memory usage: 7.9+ KB

In [12]:
pd.to_datetime(df['Date'])

0    1997-07-05
1    1997-07-06
2    1997-07-07
3    1997-07-08
4           NaT
        ...
95   1997-10-08
96   1997-10-09
97   1997-10-10
98   1997-10-11
99   1997-10-12
Name: Date, Length: 100, dtype: datetime64[ns]

In [13]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        97 non-null     datetime64[ns]
 1   Price       100 non-null    int64
 2   Quantity    100 non-null    int64
 3   Width       97 non-null     float64
 4   Height      97 non-null     float64
 5   Quality     96 non-null     float64
 6   Score       93 non-null     float64
 7   Difference  99 non-null     float64
 8   Color       96 non-null     object
 9   Shape       95 non-null     object
dtypes: datetime64[ns](1), float64(5), int64(2), object(2)
memory usage: 7.9+ KB

In [15]:
pd.read_csv('sample1_with_index.csv', index_col=0, parse_dates=['Date']).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        97 non-null     datetime64[ns]
 1   Price       100 non-null    int64
 2   Quantity    100 non-null    int64
 3   Width       97 non-null     float64
 4   Height      97 non-null     float64
 5   Quality     96 non-null     float64
 6   Score       93 non-null     float64
 7   Difference  99 non-null     float64
 8   Color       96 non-null     object
 9   Shape       95 non-null     object
dtypes: datetime64[ns](1), float64(5), int64(2), object(2)
memory usage: 8.6+ KB

df['Price'][0]

In [17]:
df['Price'][0]

2291

In [18]:
type(df['Price'])

pandas.core.series.Series

In [19]:
df.loc[0:3, 'Date' : 'Quantity']

        Date  Price  Quantity
0 1997-07-05   2291        25
1 1997-07-06    506        16
2 1997-07-07   9629        32
3 1997-07-08   6161        67

In [20]:
df.loc[[1, 3, 5], 'Width']

1    1.915208
3    6.375209
5    9.456832
Name: Width, dtype: float64

In [21]:
df.iloc[0:3, 0:3]

        Date  Price  Quantity
0 1997-07-05   2291        25
1 1997-07-06    506        16
2 1997-07-07   9629        32

In [22]:
df.iloc[[0, 5, 10], [4, 5]]

      Height    Quality
0   5.305868  45.893300
5   0.600447  53.126670
10  5.615089  58.913664

In [23]:
df.iloc[0:3, df.columns.get_loc('Color')]

0    green
1     blue
2     blue
Name: Color, dtype: object